In [1]:
import pandas as pd

### Load the data into dataframes, and check to ensure integrity

In [33]:
# Load the datasets into panda dataframes
salary_df = pd.read_csv('../data/salary.csv')
housing_df = pd.read_csv('../data/home_values.csv')
col_df = pd.read_csv('../data/cost_of_living.csv')

In [34]:
salary_df.head()

,AREA,AREA_TITLE,AREA_TYPE,PRIM_STATE,NAICS,NAICS_TITLE,I_GROUP,OWN_CODE,OCC_CODE,OCC_TITLE,...,H_MEDIAN,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90,ANNUAL,HOURLY
0,47,Tennessee,2,TN,0,Cross-industry,cross-industry,1235,15-2051,Data Scientists,...,50.34,66.29,91.35,"61,960","82,060","104,700","137,880","190,000",NaN,NaN
1,48,Texas,2,TX,0,Cross-industry,cross-industry,1235,15-2051,Data Scientists,...,51.22,66.15,81.40,"61,230","81,140","106,540","137,590","169,310",NaN,NaN
2,47,Tennessee,2,TN,0,Cross-industry,cross-industry,1235,29-1141,Registered Nurses,...,38.00,42.49,49.06,"59,540","67,110","79,030","88,380","102,040",NaN,NaN
3,48,Texas,2,TX,0,Cross-industry,cross-industry,1235,29-1141,Registered Nurses,...,43.27,49.14,58.69,"64,660","77,450","90,010","102,200","122,060",NaN,NaN
4,10180,"Abilene, TX",4,TX,0,Cross-industry,cross-industry,1235,15-2051,Data Scientists,...,45.82,54.20,62.01,"39,080","65,090","95,310","112,730","128,980",NaN,NaN

In [35]:
housing_df.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,1/31/2000,2/29/2000,3/31/2000,4/30/2000,5/31/2000,...,8/31/2024,9/30/2024,10/31/2024,11/30/2024,12/31/2024,1/31/2025,2/28/2025,3/31/2025,4/30/2025,5/31/2025
0,102001,0,United States,country,NaN,124341.4562,124560.2127,124831.5029,125413.3673,126083.0233,...,366082.5346,366541.0340,367139.8895,367641.5758,368374.1942,369014.8924,369482.2883,369202.3862,368665.5743,367968.7057
1,394913,1,"New York, NY",msa,NY,222144.7324,223088.7221,224041.4550,225972.0603,227971.2690,...,684259.3824,688392.1380,692009.2026,694852.7965,696684.0190,697783.9714,699099.8650,700827.9523,703306.7753,705107.6255
2,753899,2,"Los Angeles, CA",msa,CA,227474.6703,228321.1647,229448.6871,231692.0781,234145.6444,...,968498.3033,975119.7774,980502.5479,985140.3668,989285.8683,989838.1139,987754.6575,982522.4865,978090.5113,973190.3033
3,394463,3,"Chicago, IL",msa,IL,157959.1465,158105.3707,158383.8571,159076.6623,159910.0236,...,332736.3341,333770.6434,334778.5778,335849.1447,337135.0235,338519.7976,339906.1230,340776.9626,341395.6137,341694.7701
4,394514,4,"Dallas, TX",msa,TX,130592.6920,130650.8585,130717.7267,130891.3766,131120.3293,...,385874.0269,385669.1886,385559.5613,385261.0522,384718.5649,384177.3123,383371.6226,381834.2156,379657.8131,377185.6705

In [36]:
col_df.head()

,Rank,City,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
0,1,"New York, NY",100.0,100.0,100.0,100.0,100.0,100.0
1,2,"Honolulu, HI",94.6,57.8,78.5,120.2,84.7,106.3
2,3,"San Francisco, CA",90.3,78.5,85.1,99.4,91.3,168.6
3,4,"Seattle, WA",85.5,60.8,74.7,94.2,87.2,171.5
4,5,"San Jose, CA",84.0,76.0,80.5,89.8,77.7,139.7

#### Merge the dataframes into one singular dataset to be used for mapping

In [37]:
salary_df.columns.tolist()

['AREA',
 'AREA_TITLE',
 'AREA_TYPE',
 'PRIM_STATE',
 'NAICS',
 'NAICS_TITLE',
 'I_GROUP',
 'OWN_CODE',
 'OCC_CODE',
 'OCC_TITLE',
 'O_GROUP',
 'TOT_EMP',
 'EMP_PRSE',
 'JOBS_1000',
 'LOC_QUOTIENT',
 'PCT_TOTAL',
 'PCT_RPT',
 'H_MEAN',
 'A_MEAN',
 'MEAN_PRSE',
 'H_PCT10',
 'H_PCT25',
 'H_MEDIAN',
 'H_PCT75',
 'H_PCT90',
 'A_PCT10',
 'A_PCT25',
 'A_MEDIAN',
 'A_PCT75',
 'A_PCT90',
 'ANNUAL',
 'HOURLY']

In [38]:
housing_df.columns.tolist()

['RegionID',
 'SizeRank',
 'RegionName',
 'RegionType',
 'StateName',
 '1/31/2000',
 '2/29/2000',
 '3/31/2000',
 '4/30/2000',
 '5/31/2000',
 '6/30/2000',
 '7/31/2000',
 '8/31/2000',
 '9/30/2000',
 '10/31/2000',
 '11/30/2000',
 '12/31/2000',
 '1/31/2001',
 '2/28/2001',
 '3/31/2001',
 '4/30/2001',
 '5/31/2001',
 '6/30/2001',
 '7/31/2001',
 '8/31/2001',
 '9/30/2001',
 '10/31/2001',
 '11/30/2001',
 '12/31/2001',
 '1/31/2002',
 '2/28/2002',
 '3/31/2002',
 '4/30/2002',
 '5/31/2002',
 '6/30/2002',
 '7/31/2002',
 '8/31/2002',
 '9/30/2002',
 '10/31/2002',
 '11/30/2002',
 '12/31/2002',
 '1/31/2003',
 '2/28/2003',
 '3/31/2003',
 '4/30/2003',
 '5/31/2003',
 '6/30/2003',
 '7/31/2003',
 '8/31/2003',
 '9/30/2003',
 '10/31/2003',
 '11/30/2003',
 '12/31/2003',
 '1/31/2004',
 '2/29/2004',
 '3/31/2004',
 '4/30/2004',
 '5/31/2004',
 '6/30/2004',
 '7/31/2004',
 '8/31/2004',
 '9/30/2004',
 '10/31/2004',
 '11/30/2004',
 '12/31/2004',
 '1/31/2005',
 '2/28/2005',
 '3/31/2005',
 '4/30/2005',
 '5/31/2005',
 '6/30/2005',
 '7/31/2005',
 '8/31/2005',
 '9/30/2005',
 '10/31/2005',
 '11/30/2005',
 '12/31/2005',
 '1/31/2006',
 '2/28/2006',
 '3/31/2006',
 '4/30/2006',
 '5/31/2006',
 '6/30/2006',
 '7/31/2006',
 '8/31/2006',
 '9/30/2006',
 '10/31/2006',
 '11/30/2006',
 '12/31/2006',
 '1/31/2007',
 '2/28/2007',
 '3/31/2007',
 '4/30/2007',
 '5/31/2007',
 '6/30/2007',
 '7/31/2007',
 '8/31/2007',
 '9/30/2007',
 '10/31/2007',
 '11/30/2007',
 '12/31/2007',
 '1/31/2008',
 '2/29/2008',
 '3/31/2008',
 '4/30/2008',
 '5/31/2008',
 '6/30/2008',
 '7/31/2008',
 '8/31/2008',
 '9/30/2008',
 '10/31/2008',
 '11/30/2008',
 '12/31/2008',
 '1/31/2009',
 '2/28/2009',
 '3/31/2009',
 '4/30/2009',
 '5/31/2009',
 '6/30/2009',
 '7/31/2009',
 '8/31/2009',
 '9/30/2009',
 '10/31/2009',
 '11/30/2009',
 '12/31/2009',
 '1/31/2010',
 '2/28/2010',
 '3/31/2010',
 '4/30/2010',
 '5/31/2010',
 '6/30/2010',
 '7/31/2010',
 '8/31/2010',
 '9/30/2010',
 '10/31/2010',
 '11/30/2010',
 '12/31/2010',
 '1/31/2011',
 '2/28/2011',
 '3/31/2011',
 '4/30/2011',
 '5/31/2011',
 '6/30/2011',
 '7/31/2011',
 '8/31/2011',
 '9/30/2011',
 '10/31/2011',
 '11/30/2011',
 '12/31/2011',
 '1/31/2012',
 '2/29/2012',
 '3/31/2012',
 '4/30/2012',
 '5/31/2012',
 '6/30/2012',
 '7/31/2012',
 '8/31/2012',
 '9/30/2012',
 '10/31/2012',
 '11/30/2012',
 '12/31/2012',
 '1/31/2013',
 '2/28/2013',
 '3/31/2013',
 '4/30/2013',
 '5/31/2013',
 '6/30/2013',
 '7/31/2013',
 '8/31/2013',
 '9/30/2013',
 '10/31/2013',
 '11/30/2013',
 '12/31/2013',
 '1/31/2014',
 '2/28/2014',
 '3/31/2014',
 '4/30/2014',
 '5/31/2014',
 '6/30/2014',
 '7/31/2014',
 '8/31/2014',
 '9/30/2014',
 '10/31/2014',
 '11/30/2014',
 '12/31/2014',
 '1/31/2015',
 '2/28/2015',
 '3/31/2015',
 '4/30/2015',
 '5/31/2015',
 '6/30/2015',
 '7/31/2015',
 '8/31/2015',
 '9/30/2015',
 '10/31/2015',
 '11/30/2015',
 '12/31/2015',
 '1/31/2016',
 '2/29/2016',
 '3/31/2016',
 '4/30/2016',
 '5/31/2016',
 '6/30/2016',
 '7/31/2016',
 '8/31/2016',
 '9/30/2016',
 '10/31/2016',
 '11/30/2016',
 '12/31/2016',
 '1/31/2017',
 '2/28/2017',
 '3/31/2017',
 '4/30/2017',
 '5/31/2017',
 '6/30/2017',
 '7/31/2017',
 '8/31/2017',
 '9/30/2017',
 '10/31/2017',
 '11/30/2017',
 '12/31/2017',
 '1/31/2018',
 '2/28/2018',
 '3/31/2018',
 '4/30/2018',
 '5/31/2018',
 '6/30/2018',
 '7/31/2018',
 '8/31/2018',
 '9/30/2018',
 '10/31/2018',
 '11/30/2018',
 '12/31/2018',
 '1/31/2019',
 '2/28/2019',
 '3/31/2019',
 '4/30/2019',
 '5/31/2019',
 '6/30/2019',
 '7/31/2019',
 '8/31/2019',
 '9/30/2019',
 '10/31/2019',
 '11/30/2019',
 '12/31/2019',
 '1/31/2020',
 '2/29/2020',
 '3/31/2020',
 '4/30/2020',
 '5/31/2020',
 '6/30/2020',
 '7/31/2020',
 '8/31/2020',
 '9/30/2020',
 '10/31/2020',
 '11/30/2020',
 '12/31/2020',
 '1/31/2021',
 '2/28/2021',
 '3/31/2021',
 '4/30/2021',
 '5/31/2021',
 '6/30/2021',
 '7/31/2021',
 '8/31/2021',
 '9/30/2021',
 '10/31/2021',
 '11/30/2021',
 '12/31/2021',
 '1/31/2022',
 '2/28/2022',
 '3/31/2022',
 '4/30/2022',
 '5/31/2022',
 '6/30/2022',
 '7/31/2022',
 '8/31/2022',
 '9/30/2022',
 '10/31/2022',
 '11/30/2022',
 '12/31/2022',
 '1/31/2023',
 '2/28/2023',
 '3/31/2023',
 '4/30/2023',
 '5/31/2023',
 '6/30/2023',
 '7/31/2023',
 '8/31/2023',
 '9/30/2023',
 '10/31/2023',
 '11/30/2023',
 '12/31/2023',
 '1/31/2024',
 '2/29/2024',
 '3/31/2024',
 '4/30/2024',
 '5/31/2024',
 '6/30/2024',
 '7/31/2024',
 '8/31/2024',
 '9/30/2024',
 '10/31/2024',
 '11/30/2024',
 '12/31/2024',
 '1/31/2025',
 '2/28/2025',
 '3/31/2025',
 '4/30/2025',
 '5/31/2025']

In [39]:
col_df.columns.tolist()

['Rank',
 'City',
 'Cost of Living Index',
 'Rent Index',
 'Cost of Living Plus Rent Index',
 'Groceries Index',
 'Restaurant Price Index',
 'Local Purchasing Power Index']

In [40]:
salary_df[['AREA_TITLE', 'PRIM_STATE']].drop_duplicates().head(10)

                          AREA_TITLE PRIM_STATE
0                          Tennessee         TN
1                              Texas         TX
4                        Abilene, TX         TX
5                       Amarillo, TX         TX
6   Austin-Round Rock-San Marcos, TX         TX
7           Beaumont-Port Arthur, TX         TX
8                 Chattanooga, TN-GA         TN
9                 Clarksville, TN-KY         TN
10         College Station-Bryan, TX         TX
11                Corpus Christi, TX         TX

In [41]:
housing_df[['RegionName', 'StateName']].drop_duplicates().head(10)

         RegionName StateName
0     United States       NaN
1      New York, NY        NY
2   Los Angeles, CA        CA
3       Chicago, IL        IL
4        Dallas, TX        TX
5       Houston, TX        TX
6    Washington, DC        VA
7  Philadelphia, PA        PA
8         Miami, FL        FL
9       Atlanta, GA        GA

In [42]:
col_df[['City']].drop_duplicates().head(10)

                City
0       New York, NY
1       Honolulu, HI
2  San Francisco, CA
3        Seattle, WA
4       San Jose, CA
5     Washington, DC
6         Boston, MA
7    Los Angeles, CA
8      San Diego, CA
9          Miami, FL

In [45]:
# Remove the State level rows from the salary_df dataset
# Will only keep rows where the AREA_TITLE contains a , like "Houston, TX"
# Will eliminate "USA", "TX" and other single state/country references
salary_df = salary_df[salary_df['AREA_TITLE'].str.contains(",")]

# Seperate the city, state into two seperate columns for better matching
salary_df[['City', 'State']] = salary_df['AREA_TITLE'].str.split(",", expand=True)

# Remove any city after the initial City in some of the longer - ones
salary_df['City'] = salary_df['City'].str.split('-').str[0].str.strip().str.title()
salary_df['State'] = salary_df['State'].str.split('-').str[0].str.strip().str.upper()

# Verify changes
salary_df[['City', 'State']].head(10)

               City State
4           Abilene    TX
5          Amarillo    TX
6            Austin    TX
7          Beaumont    TX
8       Chattanooga    TN
9       Clarksville    TN
10  College Station    TX
11   Corpus Christi    TX
12           Dallas    TX
13          El Paso    TX

In [46]:
# Remove the State level rows from the housing_df dataset
# Will only keep rows where the RegionName contains a , like "Houston, TX"
# Will eliminate "USA", "TX" and other single state/country references
housing_df = housing_df[housing_df['RegionName'].str.contains(",")]

# Seperate the city, state into two seperate columns for better matching
housing_df[['City', 'State']] = housing_df['RegionName'].str.split(",", expand=True)

# Trim Whitespace from city and state columns
housing_df['City'] = housing_df['City'].str.strip()
housing_df['State'] = housing_df['State'].str.strip()

# Verify changes
housing_df[['City', 'State']].head(10)

            City State
1       New York    NY
2    Los Angeles    CA
3        Chicago    IL
4         Dallas    TX
5        Houston    TX
6     Washington    DC
7   Philadelphia    PA
8          Miami    FL
9        Atlanta    GA
10        Boston    MA

In [47]:
# Seperate the city, state into two seperate columns for better matching
col_df[['City', 'State']] = col_df['City'].str.split(",", expand=True)

# Trim Whitespace from city and state columns
col_df['City'] = col_df['City'].str.strip()
col_df['State'] = col_df['State'].str.strip()

# Verify changes
col_df[['City', 'State']].head(10)

            City State
0       New York    NY
1       Honolulu    HI
2  San Francisco    CA
3        Seattle    WA
4       San Jose    CA
5     Washington    DC
6         Boston    MA
7    Los Angeles    CA
8      San Diego    CA
9          Miami    FL

#### Merge the datasets into one

In [49]:
# Merge salary_df and housing_df into one dataframe
salary_housing_df = pd.merge(salary_df, housing_df, on=['City', 'State'], how='outer', indicator=True)

# Verify the merge worked
salary_housing_df.head(10)

,AREA,AREA_TITLE,AREA_TYPE,PRIM_STATE,NAICS,NAICS_TITLE,I_GROUP,OWN_CODE,OCC_CODE,OCC_TITLE,...,9/30/2024,10/31/2024,11/30/2024,12/31/2024,1/31/2025,2/28/2025,3/31/2025,4/30/2025,5/31/2025,_merge
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,225237.5166,226581.6432,228173.2308,229368.0969,229336.9850,229195.4095,228894.9885,229352.6821,230157.0799,right_only
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,331359.7536,331825.2218,331632.6807,330622.7235,329226.6443,328415.2677,327703.3037,327341.4136,326610.5576,right_only
2,10180.0,"Abilene, TX",4.0,TX,0.0,Cross-industry,cross-industry,1235.0,15-2051,Data Scientists,...,199842.9179,199634.2734,199439.6882,199545.9002,199890.3326,200418.3571,200560.5434,200357.8324,199927.0700,both
3,10180.0,"Abilene, TX",4.0,TX,0.0,Cross-industry,cross-industry,1235.0,29-1141,Registered Nurses,...,199842.9179,199634.2734,199439.6882,199545.9002,199890.3326,200418.3571,200560.5434,200357.8324,199927.0700,both
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,180876.6936,180471.5058,180541.2293,181386.8182,182609.4158,183337.5230,182884.6716,181262.8455,179577.4986,right_only
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,234550.8116,234190.4951,234223.4330,235002.8835,235660.1581,236096.3907,235658.3669,235363.2475,235660.6345,right_only
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,225302.6420,225766.0575,226372.1861,227555.0443,228911.3657,230204.7700,230915.8011,231337.2272,231601.3611,right_only
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,221119.3008,223553.8979,225583.0658,227825.5961,229366.2396,230899.0264,232116.3956,233353.6348,234137.3977,right_only
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,164814.5451,164414.2211,163829.2152,163850.1115,163969.3964,164174.5574,163855.4499,163080.5198,162098.2920,right_only
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,345645.9663,346679.8273,347446.9738,348533.3157,349414.1614,350478.6723,350971.9615,351749.9308,352790.9331,right_only

In [50]:
# Rows that exist in salary/housing but not in COL data
unmatched_left = salary_housing_df[salary_housing_df['_merge'] == 'left_only'][['City', 'State']]

# Rows that exist in COL but not in salary/housing
unmatched_right = salary_housing_df[salary_housing_df['_merge'] == 'right_only'][['City', 'State']]

# Optional: Reset index for viewing
unmatched_left = unmatched_left.reset_index(drop=True)
unmatched_right = unmatched_right.reset_index(drop=True)

In [56]:
# Drop the _merge column, so we can re add it with this merge
salary_housing_df = salary_housing_df.drop(columns=['_merge'])

# Merge the new salary_housing_df with col_df and save as a new dataframe
full_df = pd.merge(salary_housing_df, col_df, on=['City', 'State'], how='inner', indicator=True)

full_df.head(10)

,AREA,AREA_TITLE,AREA_TYPE,PRIM_STATE,NAICS,NAICS_TITLE,I_GROUP,OWN_CODE,OCC_CODE,OCC_TITLE,...,4/30/2025,5/31/2025,Rank,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index,_merge
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,347329.6436,347309.5393,48,58.9,31.3,46.8,67.5,64.1,165.8,both
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,390647.7478,389096.7596,18,69.2,42.5,57.5,79.9,70.6,170.2,both
2,12420.0,"Austin-Round Rock-San Marcos, TX",4.0,TX,0.0,Cross-industry,cross-industry,1235.0,15-2051,Data Scientists,...,455311.8544,451858.3309,41,61.7,49.5,56.4,65.4,66.3,166.5,both
3,12420.0,"Austin-Round Rock-San Marcos, TX",4.0,TX,0.0,Cross-industry,cross-industry,1235.0,29-1141,Registered Nurses,...,455311.8544,451858.3309,41,61.7,49.5,56.4,65.4,66.3,166.5,both
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,401962.2034,402126.9946,25,67.0,42.9,56.5,77.7,66.2,139.5,both
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,734297.7434,733270.3837,7,82.5,79.1,81.0,90.5,87.3,145.0,both
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,391776.1566,390896.0049,27,66.6,46.7,57.9,77.3,63.9,145.7,both
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,341395.6137,341694.7701,15,71.5,55.8,64.6,79.2,75.8,157.3,both
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,300925.4526,301042.0854,49,54.8,36.2,46.7,60.6,53.4,170.2,both
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,243108.3076,243743.2934,44,61.2,33.7,49.2,69.3,56.4,134.7,both

#### Clean up the full_df to eliminate empty rows and not important data

In [57]:
# Remove rows without an OCC_TITLE.  This is to eliminate rows where we don't have salaries for certain cities
# ~ is the NOT qualifier in pandas
full_df_cleaned = full_df[~full_df['OCC_TITLE'].isna()].copy()

In [67]:
# Select only the columns we need
selected_columns = [
    'City', 'State', 'OCC_TITLE', 'A_MEAN', '5/31/2025',
    'Cost of Living Index', 'Local Purchasing Power Index'
]

# Create the final_df with the seleced columns
final_df = full_df_cleaned[selected_columns].copy()

# Rename the columns for readability
final_df = final_df.rename(columns={
    'A_MEAN': 'Avg_Annual_Salary',
    '5/31/2025': 'Avg_Home_Value',
    'Cost of Living Index': 'COL_Index',
    'Local Purchasing Power Index': 'Purchasing_Power_Index'
})

# Clean up the Avg_Annual_Salary so it can be converted to numeric
final_df['Avg_Annual_Salary'] = (
    final_df['Avg_Annual_Salary']
    .str.replace('$', '', regex=False)
    .str.replace(',', '', regex=False)
    .str.strip()
)

# Convert the annual salary into numeric (currently object)
final_df['Avg_Annual_Salary'] = pd.to_numeric(final_df['Avg_Annual_Salary'], errors='coerce')

final_df.head()

,City,State,OCC_TITLE,Avg_Annual_Salary,Avg_Home_Value,COL_Index,Purchasing_Power_Index
2,Austin,TX,Data Scientists,124780,451858.3309,61.7,166.5
3,Austin,TX,Registered Nurses,93060,451858.3309,61.7,166.5
12,Dallas,TX,Data Scientists,119130,377185.6705,67.8,162.7
13,Dallas,TX,Registered Nurses,96720,377185.6705,67.8,162.7
16,Houston,TX,Data Scientists,111440,314262.4259,61.6,169.8

#### Sepearte Databases for each career, as well as create a joint database

In [68]:
# Create two seperate dataframes based on the jobs
data_job_df = final_df[final_df['OCC_TITLE'] == 'Data Scientists'].copy()
rn_df = final_df[final_df['OCC_TITLE'] == 'Registered Nurses'].copy()

In [70]:
# Add affordibility metric to each dataframe
data_job_df['Affordability'] = data_job_df['Avg_Annual_Salary'] / (data_job_df['Avg_Home_Value'] * data_job_df['COL_Index'])
rn_df['Affordability'] = rn_df['Avg_Annual_Salary'] / (rn_df['Avg_Home_Value'] * rn_df['COL_Index'])

In [71]:
# Combine the two databases into one
combined_df = pd.merge(
    data_job_df, rn_df,
    on=['City', 'State'],
    how='inner',
    suffixes=('_You', '_RN')
)

In [72]:
# add the combined values into the combined_df
combined_df['Combined_Income'] = (
    combined_df['Avg_Annual_Salary_You'] + combined_df['Avg_Annual_Salary_RN']
)


# Keep the current home value and COL index (Should be equal across both RN and YOU dataframes)
combined_df['Home_Value'] = combined_df['Avg_Home_Value_You']
combined_df['COL_Index'] = combined_df['COL_Index_You']

# Calculate the true affordability with combined income
combined_df['Combined_Affordability'] = (
    combined_df['Combined_Income'] / (combined_df['Home_Value'] * combined_df['COL_Index'])
)

In [73]:
# Drop the non needed columns from the combined_df
combined_df = combined_df.drop(columns = [
    'Avg_Home_Value_RN',
    'Avg_Home_Value_You',
    'COL_Index_You',
    'COL_Index_RN',
    'Purchasing_Power_Index_You',
    'Purchasing_Power_Index_RN'
])

In [75]:
combined_df[['City', 'State', 'Combined_Income', 'Home_Value', 'COL_Index', 'Combined_Affordability']].sort_values(by='Combined_Affordability', ascending=False).head(10)

,City,State,Combined_Income,Home_Value,COL_Index,Combined_Affordability
4,San Antonio,TX,202590,286497.2030,59.0,0.011985
2,Houston,TX,208170,314262.4259,61.6,0.010753
1,Dallas,TX,215850,377185.6705,67.8,0.008440
0,Austin,TX,217840,451858.3309,61.7,0.007814
3,Nashville,TN,212420,459668.1680,67.2,0.006877

In [76]:
# Save the combined_df to csv
combined_df.to_csv('../data/combined_affordability.csv', index=False)